# 파이썬 복습

In [1]:
import pandas as pd
import seaborn as sns
import plotly.express as px

import matplotlib.pyplot as plt
import matplotlib as mpl

In [32]:
price=int(input("제품 가격"))
user=int(input("투입 금액"))

def vending(price, user):
    if user>= price:
        change = user - price
        print (f"거스름돈은 {change}.")
    else:
        de = user - price
        print (f"{de}.")
vending(price, user)

제품 가격1000
투입 금액1000
거스름돈은 0.

In [34]:
price=int(input("제품 가격"))
user=int(input("투입 금액"))

def vending(price, user):
    if user>= price:
        return True
    else:
        return  False
vending(price, user)

제품 가격1000
투입 금액1000

True

In [38]:
import re
re.search('L', 'HELLO123&&*')

In [39]:
str1='hello~000000python'

In [43]:
re.sub('\d\d\d\d\d\d', '123456', str1)

'hello~123456python'

In [50]:
str3='hello~ 123-456python'

In [52]:
re.findall('\d\d\d', str3)

['123', '456']

In [60]:
print('파이썬\t이스케이프\t문자\t실습')

파이썬	이스케이프	문자	실습

In [62]:
A=int(input('숫자 하나 입력.'))

for i in range(2, A+1, 2):
    print(i)

숫자 하나 입력.6
2
4
6

In [66]:
A=int(input('숫자 하나 입력.'))

for i in range(1, A+1, 2):
    print(i)

숫자 하나 입력.5
1
3
5

In [69]:
B=int(input('숫자 하나 입력.'))

ind=2
while ind <= B:
    print(ind)
    ind+=2

숫자 하나 입력.6
2
4
6

In [95]:
odd_elements = lst[1::2]
result_sum=0
for num in odd_elements:
    result_sum +=num

def odd_index_sum(lst):
    odd_elements = [lst[i] for i in range(1, len(lst), 2)]
    result_sum(odd_elements)
    return result_sum

TypeError: 'int' object is not subscriptable

In [92]:
odd_index_sum([1, 2, 3, 4, 5])

NameError: name 'result_sum' is not defined

In [99]:
def odd_index_sum(lst):
    odd_elements = [lst[i] for i in range(0, len(lst), 2)]  # 홀수 번째 원소들을 추출
    result_sum = sum(odd_elements)  # 추출한 원소들의 합 계산
    return result_sum

In [100]:
odd_index_sum([1,2,3,4,5])

9

In [112]:
def odd(lst):
    odd_el = [lst[i] for i in range(1, len(lst)+1, 2)]
    reversed = odd_el[::-1]
    return reversed

In [113]:
odd([1, 2, 3, 4, 5, 6])

[6, 4, 2]

In [110]:
def reverse_even(lst):
    even_elements = [lst[i] for i in range(1, len(lst)+1, 2)]  # 짝수 번째 원소들을 추출
    reversed_list = even_elements[::-1]  # 추출한 원소들을 역순으로 정렬
    return reversed_list

In [111]:
reverse_even([1, 2, 3, 4, 5, 6])

[6, 4, 2]

In [117]:


def separate_chars(s):
    # 여기에 코드를 작성하세요
    if s[0::2] == True:
        return 'Pto'
    elif s[1::2]==True:
        return 'yhn'

In [120]:
separate_chars()

NameError: name 's' is not defined

In [121]:
def separate_chars(s):
    odd_chars = s[0::2]  # 홀수 번째 문자 추출
    even_chars = s[1::2]  # 짝수 번째 문자 추출

    return odd_chars, even_chars  # 튜플로 결과 반환

In [122]:
separate_chars("python")

('pto', 'yhn')

In [123]:
def unique_chars(s):
    unique_set=set(s)
    unique_str=' '.join(unique_set)
    return unique_str

In [125]:
unique_chars('programming')

'r p n o m g i a'

In [126]:
def unique_chars(s):
    unique_set = set()
    unique_string = ''
    
    for char in s:
        if char not in unique_set:
            unique_set.add(char)
            unique_string += char

    return unique_string

In [127]:
unique_chars('programming')

'progamin'

In [128]:
import pandas as pd

data = {'제품명': ['A', 'B', 'C'],
        '금액': [5000, 8000, 12000]}
df = pd.DataFrame(data)

In [129]:
df

  제품명     금액
0   A   5000
1   B   8000
2   C  12000

In [135]:
df['천원단위금액']=df['금액']/1000

In [136]:
df

  제품명     금액  천원단위금액
0   A   5000     5.0
1   B   8000     8.0
2   C  12000    12.0

In [137]:
import pandas as pd

data = {'이름': ['Alice', 'Bob', 'Charlie', 'David'],
        '점수': [90, 75, 82, 95]}
df = pd.DataFrame(data)

In [138]:
df

        이름  점수
0    Alice  90
1      Bob  75
2  Charlie  82
3    David  95

In [149]:
m=df['점수'] >= 90
df[m]

      이름  점수
0  Alice  90
3  David  95

In [150]:
import pandas as pd

data = {'이름': ['Alice', 'Bob', 'Charlie', 'David'],
        '성적': ['A', 'C', 'B', 'A']}
df = pd.DataFrame(data)

In [152]:
df.query("'A'==성적 or 'B'==성적")

        이름 성적
0    Alice  A
2  Charlie  B
3    David  A

In [153]:
import pandas as pd

data = {'이름': ['Alice', 'Bob', 'Charlie', 'David'],
        '수학': [90, 75, 82, 95],
        '과학': [88, 92, 80, 78]}
df = pd.DataFrame(data)

In [159]:
df['평균점수']=(df['수학']+df['과학'])/2
df['평균점수']

0    89.0
1    83.5
2    81.0
3    86.5
Name: 평균점수, dtype: float64

In [160]:
import pandas as pd

data = {'이름': ['Alice', 'Bob', 'Charlie', 'David'],
        '영어': [85, 75, 92, 88],
        '수학': [90, 78, 82, 95]}
df = pd.DataFrame(data)

In [161]:
df.query("영어>80 and 수학>70")

        이름  영어  수학
0    Alice  85  90
2  Charlie  92  82
3    David  88  95

In [162]:
import pandas as pd

data = {'이름': ['Alice', 'Bob', 'Charlie', 'David'],
        '국어': [85, 90, 92, 88],
        '영어': [80, 85, 88, 78],
        '수학': [88, 92, 82, 95]}
df = pd.DataFrame(data)

In [163]:
df.query("국어>80 and 영어>80 and 수학>70")

        이름  국어  영어  수학
1      Bob  90  85  92
2  Charlie  92  88  82

In [170]:
최고점수_값=df['수학'].idxmax()
최고점수=df.loc[최고점수_값]
최고점수

이름    David
국어       88
영어       78
수학       95
Name: 3, dtype: object

In [171]:
import pandas as pd

data = {'이름': ['Alice', 'Bob', 'Charlie', 'David'],
        '과학': [88, 92, 80, 78]}
df = pd.DataFrame(data)

In [177]:
과학평균=df['과학'].mean()
m=df['과학'] >= 과학평균
df[m]

In [181]:
import pandas as pd

data = {'이름': ['Alice', 'Bob', 'Charlie', 'David'],
        '국어': [85, 90, 92, 88],
        '영어': [80, 85, 88, 78],
        '수학': [88, 92, 82, 95]}
df = pd.DataFrame(data)

In [192]:
최저점수=df[['국어','영어','수학']].min().min()
최저점수

78

In [193]:
import pandas as pd

data = {'이름': ['Alice', 'Bob', 'Charlie', 'David'],
        '과목': ['국어', '영어', '국어', '수학'],
        '점수': [85, 90, 92, 88]}
df = pd.DataFrame(data)

In [207]:

최고점수 = df.loc[ df['점수'].idxmax()]

TypeError: reduction operation 'argmax' not allowed for this dtype

In [208]:
def max_profit(prices):
    if not prices or len(prices) == 1:
        return 0
    
    max_profit = 0
    min_price = prices[0]
    
    for price in prices[1:]:
        # 현재 가격에서 이전 최소 가격을 뺀 값이 최대 수익인지 확인
        max_profit = max(max_profit, price - min_price)
        # 현재 가격이 이전 최소 가격보다 작으면 최소 가격 갱신
        min_price = min(min_price, price)
    
    return max_profit

# 예시
prices = [7, 1, 5, 3, 6, 4]
result = max_profit(prices)
print(result)  # 출력: 5

5

In [209]:
arr1 = [1, 3, 5, 7]
arr2 = [2, 4, 6, 8]